Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/getting_married/getting_married.html.txt.tmx
Source language: en
Languages: ga

source: Getting married is a big decision and is one of the most significant events in someone's life
ga: Is cinneadh tábhachtach é nuair a shocraíonn duine go bpósfaidh sé/sí agus is é ceann de na heachtraí is tábhachtaí é i saol duine

source: Aside from the excitement involved in planning your big day, there are rules and procedures you must follow in order to marry in Ireland
ga: Chomh maith leis an scleondar a bhaineann le pleanáil do lae mhóir, tá rialacha agus nósanna imeachta a chaithfidh tú a leanúint chun go mbeidh tú in ann pósadh in Éirinn

source: There are also rules and procedures if you are ordinarily resident here and choose to marry abroad
ga: Baineann rialacha agus nósanna imeachta leis chomh maith má roghnaíonn tú pósadh thar lear

source: Here, we start at the beginning and guide you through the various things you need to know
ga: Anseo, tósaímid ag an tús agus tugaimid treoir duit trí na nithe éagsúla a chaithfidh tú a bheith ar an eolas futhu

source: Aside from the rules about how and where you can marry, marriage will immediately affect lots of areas of your life
ga: Beidh tionchar láithreach ar go leor réimsí de do shaol, taobh amuigh de na rialacha a bhaineann le cén uair agus cén áit is féidir leat pósadh

source: You may not be aware but your legal status, your inheritance rights, and pensions are just some things that will change
ga: B’fhéidir nach bhfeasach duit é, ach ar chuid de na nithe a athróidh tá do stádas dlíthiúil, do chearta oidhreachta agus pinsin

source: Many other areas of life will also change and we examine these and other issues in this document
ga: Athróidh réimsí eile de do shaol chomh maith, agus déanaimid scrúdú orthu siúd agus ar cheisteanna eile sa doiciméad seo

source: The minimum age for getting married in Ireland is 18 years of age
ga: Is é an aois íosta chun dul ag pósadh in Éirinn 18 bliain d'aois

source: If you are ordinarily resident in Ireland and you wish to get married abroad, you must be aged at least 18
ga: Má tá tú i do chónaí de ghnáth in Éirinn agus gur mian leat a fháil pósta thar lear, ní mór duit a bheith d'aois ar a laghad 18

source: However, there are some exceptions to this in the age requirements for marriage
ga: Tá roinnt eisceachtaí i gceist, léigh faoi riachtanais aoise chun pósadh

source: Essentially, the age rule is the same, irrespective of whether or not you get married in a religious, secular or civil ceremony
ga: Go bunúsach, is ionann an riail aoise is cuma má tá sé i gceist agat pósadh le searmanas reiligúnda, saolta nó sibhialta

source: In addition, you must have the capacity to marry
ga: Chomh maith leis sin caithfidh sé go bhfuil sé ar do chumas pósadh

source: That is, you must freely consent to the marriage and have the capacity to understand what marriage means
ga: Is é sin caithfidh tú aontú gan bac leis an bpósadh agus caithfidh sé a bheith ar do chumas a thuiscint céard a chiallaíonn pósadh

source: Read more about the legal requirements for marriage in Ireland
ga: Léigh tuilleadh faoi riachtanais dlíthiúla pósta

source: Notification requirements for marriage
ga: Riachtanais fhógra a bhaineann le pósadh

source: Since November 2007 anyone marrying in Ireland (irrespective of whether they are an Irish citizen or a foreign national) must give 3 months' notification before they marry
ga: Ó Shamhain 2007 i leith, ní mór do dhuine ar bith a phósann in Éirinn (gan aird ar cé acu an saoránach Éireannach nó náisiúnach iasachta iad) fógra 3-mhí a thabhairt sula bpósann siad

source: You must make this notification in person to any Registrar
ga: Ní mór duit an fógra seo a dhéanamh i bpearsan le Cláraitheoir ar bith

source: The requirement to give a 3-month notice does not apply to civil partners whose civil partnership was registered in Ireland
ga: Ní bhaineann an ceanglas chun fógra 3 mhí a thabhairt le páirtnéirí sibhialta ar cláraíodh a bpáirtnéireacht shibhialta in Éirinn

source: Find out how to notify the Registrar that you will be getting married in Ireland
ga: Is féidir leat faisnéis a fháil ar conas fógra a thabhairt don Chláraitheoir go bpósfar thú in Éirinn anseo

source: Different ways of getting married
ga: Bealaí éagsúla chun pósadh a dhéanamh

source: We provide a guide to the legal ways of getting married in Ireland only
ga: Faigh amach faoi searmanais phósta shibhialta in Éirinn

source: These include civil marriage ceremonies and religious and secular marriage ceremonies
ga: Léigh eolas ginearálta faoi searmanais reiligiúnda no saolts phósta in Éirinn

source: Requirements of different faiths and secular bodies may differ, so check in advance with the relevant member of the clergy or body for further information
ga: D’fhéadfadh riachtanais difriúla a bheith ag creidimh dhifriúla nó comhlachtaí saolta, mar sin seiceáil roimh ré le ball cuí den chléir nó comhlacht chun tuilleadh eolais a fháil

source: Since November 2007, no matter how you marry (i.e., through a civil, secular or religious ceremony), the registration process is the same
ga: Ón Samhain 2007, is cuma cén bealach a phósann tú (trí shearmanas sibhialta, saolta nó reiligiúnach), tá an próiseas cláraithe mar an gcéanna

source: You are issued with a Marriage Registration Form (MRF) by the Registrar, following notification, which gives you authorisation to get married
ga: Tar éis duit fógra a thabhairt, déanann an Cláraitheoir Foirm Chláraithe Pósta (FCP) a eisiúint, a thugann údarú duit le pósadh

source: You give it to the person who will be solemnising your marriage
ga: Tugann tú í seo chuig an duine a bheidh ag sollúnú an phósta agat

source: Following the marriage ceremony, the completed MRF should be given to a Registrar, within one month of the marriage ceremony, for the marriage to be registered
ga: Tar éis an tsearmanais phósta, ba chóir an FCP comhlánaithe a thabhairt chuig an gCláraitheoir laistigh d'aon mhí amháin, chun go gclárófar an pósadh

source: Getting married outside of Ireland
ga: Ag pósadh taobh amuigh d’Éirinn

source: If you are an Irish citizen and are planning to marry abroad, you should realise that the legal validity of your marriage is governed, in part, by the laws of the country in which you marry
ga: Má tá sé i gceist agat pósadh thar lear, ba cheart duit a thuiscint go mbraitheann bailíocht dlithiúil do phósta, i bpáirt, ar dhlíthe na tíre ina bpósann tú

source: In most, if not all cases, the legal formalities abroad are very different to those in Ireland
ga: Sna chuid is mó de chásanna, fiú muna mbaineann sé le chuile chás, bíonn na nósanna dlíthiúla an-éagsúil ó na cinn in Éirinn

source: You can read information for Irish citizens planning to marry abroad
ga: Tá eolas ar fáil anseo do shaoránaigh Éireannacha atá ag pleanáil pósta thar lear

source: Changes to your status following your marriage
ga: Athruithe do do stádas i ndiaidh do phósta

source: Getting married affects many areas of your life in Ireland
ga: Bíonn tionchar ag pósadh ar go leor réimsí de do shaol

source: These range from life insurance and pensions, to inheritance, presumption of paternity and even taxation
ga: Cuimsíonn siad árachas saoil agus pinsin, oidhreacht, ceapadh maidir le hatharthacht, agus fiú cáin

source: Find out how marriage affects your legal status
ga: Faigh amach cén tionchar atá ag pósadh ar do stádas dlíthiúil

source: Getting married is an exciting time in life and a serious commitment
ga: Is gealltanas tromchúiseach é pósadh

source: It is important to be aware of the various formalities and procedures in advance to help you to plan and organise your wedding
ga: Má tá tú feasach ar na nósanna imeachta éagsúla roimh ré ba cheart go gcabhróidh sé sin leat do phósadh a phleanáil agus a eagrú

source: It is also very important to be aware of how marriage will affect your legal status and understand how this change in your life will affect your rights and entitlements
ga: Chomh maith leis sin, má tá tú feasach ar na bealaí ina mbeidh tionchar ag pósadh ar do stádas dlíthiúil, cabhróidh sé sin leat na bealaí ina mbeidh tionchar ag an bpósadh ar do chearta agus do theidlíochtaí i rith do shaoil, a thuiscint
